# DataFrame
데이터프레임을 생성해 보겠습니다.

In [1]:
import pandas as pd

datas = {
    '이름': ['조조', '조운', '주유'], 
    '통솔': [96, 91, 97], 
    '무력': [72, 97, 71], 
    '지력': [91, 76, 96], 
    '정치': [94, 65, 87], 
    '매력': [96, 81, 93]
}

# 데이터프레임 생성 
pd.DataFrame(datas)

   이름  통솔  무력  지력  정치  매력
0  조조  96  72  91  94  96
1  조운  91  97  76  65  81
2  주유  97  71  96  87  93

In [2]:
# 주어진 칼럼의 데이터만 생성 
pd.DataFrame(datas, columns=['이름', '무력'])

   이름  무력
0  조조  72
1  조운  97
2  주유  71

In [3]:
# 칼럼 정보가 없으면 NaN으로 생성 
pd.DataFrame(datas, columns=['이름', '특수능력'])

   이름 특수능력
0  조조  NaN
1  조운  NaN
2  주유  NaN

In [4]:
# 인덱스 명 선언 
pd.DataFrame(datas, index=['A', 'B', 'C'])

   이름  통솔  무력  지력  정치  매력
A  조조  96  72  91  94  96
B  조운  91  97  76  65  81
C  주유  97  71  96  87  93

# 조회 
데이터프레임의 데이터를 조회하는 방법 여러 가지가 있습니다. 각 방법에 대해서 알아보겠습니다. 

+ 칼럼 기준
    + 칼럼(column)의 데이터 반환 
+ 인덱스 기준
    + 행(row)의 데이터 반환 
+ 칼럼, 인덱스 기준
    + 특정 행, 칼럼의 데이터 반환. 하나의 값을 반환할 때 사용
+ 조건 
    + 조건에 맞는 데이터를 반환 

## 칼럼 기준
칼럼 기준 데이터 조회는 컬럼명을 이용하는 방법과 속성으로 방법이 있습니다.

In [5]:
# 칼럼명으로 조회 
c = pd.DataFrame(datas)
c['이름']

0    조조
1    조운
2    주유
Name: 이름, dtype: object

In [6]:
# 멀티 칼럼 조회는 리스트로 칼럼명 조회
c[['이름', '무력']]

   이름  무력
0  조조  72
1  조운  97
2  주유  71

In [7]:
# 속성처럼 접근 
c.이름

0    조조
1    조운
2    주유
Name: 이름, dtype: object

## 인덱스 기준
인덱스 기준 데이터 조회는 `loc`, `iloc` 함수를 이용하여 접근합니다. `loc`는 인덱스명을 이용하고, `iloc`는 인덱스 번호를 이용합니다. 인덱스 슬라이싱을 이용할 수도 있습니다. 

> 인덱스 슬라이싱은 칼럼의 데이터를 가져오는 것과 유사하게 사용하기 때문에 사용할 때 주의해야 합니다.

In [8]:
# 인덱스 명. 
# 이 데이터프레임은 range index로 번호로 되어 있기 때문에 숫자로 전달 
c.loc[0]

이름    조조
통솔    96
무력    72
지력    91
정치    94
매력    96
Name: 0, dtype: object

In [9]:
# 멀티 인덱스 접근 
c.loc[[0, 1]]

   이름  통솔  무력  지력  정치  매력
0  조조  96  72  91  94  96
1  조운  91  97  76  65  81

In [10]:
# 인덱스 번호 접근 
c.iloc[0]

이름    조조
통솔    96
무력    72
지력    91
정치    94
매력    96
Name: 0, dtype: object

In [11]:
# 인덱스 슬라이싱
c[1:2]

   이름  통솔  무력  지력  정치  매력
1  조운  91  97  76  65  81

`loc`로 인덱스 정보를 가져오는 것을 명확하게 보여주기 위해서 인덱스를 문자형으로 바꾸어서 확인해 보겠습니다.

In [12]:
# 데이터 프레임의 인덱스 명을 A, B, C로 설정 
c2 = pd.DataFrame(datas, index=['A', 'B', 'C'])
c2

   이름  통솔  무력  지력  정치  매력
A  조조  96  72  91  94  96
B  조운  91  97  76  65  81
C  주유  97  71  96  87  93

In [13]:
# 인덱스 명 접근 
c2.loc['A']

이름    조조
통솔    96
무력    72
지력    91
정치    94
매력    96
Name: A, dtype: object

In [14]:
# 멀티 인덱스 접근 
c2.loc[['A', 'B']]

   이름  통솔  무력  지력  정치  매력
A  조조  96  72  91  94  96
B  조운  91  97  76  65  81

In [15]:
# 인덱스 번호 
c2.iloc[0]

이름    조조
통솔    96
무력    72
지력    91
정치    94
매력    96
Name: A, dtype: object

In [16]:
# 인덱스 슬라이싱 
c2[1:2]

   이름  통솔  무력  지력  정치  매력
B  조운  91  97  76  65  81

## 칼럼, 인덱스 기준-특정 데이터 조회 
`loc`, `iloc`, `at`를 이용하여 특정 데이터에 접근할 수 있습니다. 칼럼, 인덱스 위치를 동시에 사용하여 데이터에 접근합니다.

In [17]:
# 인덱스명. 칼럼명 이용 
c.loc[1, ['이름']]

이름    조운
Name: 1, dtype: object

In [18]:
# 인덱스 번호, 칼럼 번호 이용 
c.iloc[1, 1]

91

In [19]:
# 인덱스명, 칼럼명 이용. 값만 반환 
c.at[1, '이름']

'조운'

## 조건 
조건식을 이용하여 조회할 수 있습니다. `AND(&)`, `OR(|)` 조건을 이용할 수 있고, `isin()`을 이용하여 특정값을 찾을 수 있습니다.

In [20]:
# 무력 90 이상 
c[c['무력'] > 90]

   이름  통솔  무력  지력  정치  매력
1  조운  91  97  76  65  81

In [21]:
# 통솔, 지력이 모두 90 초과 
c[(c['통솔'] > 90) & (c['지력'] > 90)]

   이름  통솔  무력  지력  정치  매력
0  조조  96  72  91  94  96
2  주유  97  71  96  87  93

In [22]:
# 무럭이 97, 71에 있음 
c[(c['통솔'] > 90) | (c['지력'] > 90)]

   이름  통솔  무력  지력  정치  매력
0  조조  96  72  91  94  96
1  조운  91  97  76  65  81
2  주유  97  71  96  87  93

# 추가 
신규 칼럼을 추가할 때는 새로운 칼럼명에 추가할 데이터를 대입하면 됩니다. 데이터 추가는 동일한 길이의 배열을 대입합니다.

In [23]:
# 신규 칼럼 추가 
# 새로운 데이터를 이용한 추가 
c["자"] = ["맹덕", "자룡", "공근"]
c

   이름  통솔  무력  지력  정치  매력   자
0  조조  96  72  91  94  96  맹덕
1  조운  91  97  76  65  81  자룡
2  주유  97  71  96  87  93  공근

In [24]:
# 기존 데이터를 이용하여 추가 
c["무력+10"] = c["무력"] + 10
c

   이름  통솔  무력  지력  정치  매력   자  무력+10
0  조조  96  72  91  94  96  맹덕     82
1  조운  91  97  76  65  81  자룡    107
2  주유  97  71  96  87  93  공근     81

# 변경

## 칼럼의 데이터에 동일한 작업
한 칼럼의 데이터에 동일한 작업은 칼럼에 접근하여 데이터를 조작하면 됩니다. 데이터를 조작하면 복사된 데이터를 반환하기 때문에 원하는 위치에 대입해 주어야 합니다.

In [25]:
# 모든 칼럼에 동일한 작업 
c['무력'] = c['무력'] + 10
c

   이름  통솔   무력  지력  정치  매력   자  무력+10
0  조조  96   82  91  94  96  맹덕     82
1  조운  91  107  76  65  81  자룡    107
2  주유  97   81  96  87  93  공근     81

## 특정 조건의 데이터 변경
특정 조건으로 데이터를 검색하여 그 데이터의 다른 칼럼을 변경하고자 할 때는 `loc`를 이용합니다.

In [26]:
# 무력이 100보다 큰 데이터의 매력을 110으로 변경 
c.loc[c['무력'] > 100, ['매력']] = 110
c

   이름  통솔   무력  지력  정치   매력   자  무력+10
0  조조  96   82  91  94   96  맹덕     82
1  조운  91  107  76  65  110  자룡    107
2  주유  97   81  96  87   93  공근     81

## 특정 위치의 데이터 변경 
특정 위치의 데이터 변경은 `at`을 이용하면됩니다.

In [27]:
# 1번 인덱스의 이름을 자룡으로 변경 
c.at[1, '이름'] = "자룡"
c

   이름  통솔   무력  지력  정치   매력   자  무력+10
0  조조  96   82  91  94   96  맹덕     82
1  자룡  91  107  76  65  110  자룡    107
2  주유  97   81  96  87   93  공근     81

# 삭제
삭제 할 때는 `del`이나 `drop()`을 이용합니다. `drop()`은 삭제된 값을 복사해서 반환합니다. `inplace`옵션을 이용하여 바로 삭제할 수 있습니다. `axis`를 이용하여 삭제 할 데이터를 정확하게 선택해야 합니다.

In [28]:
# 통솔 삭제 
del c["통솔"]
c

   이름   무력  지력  정치   매력   자  무력+10
0  조조   82  91  94   96  맹덕     82
1  자룡  107  76  65  110  자룡    107
2  주유   81  96  87   93  공근     81

In [29]:
# 무력 삭제. axis=1 이므로 칼럼 데이터 삭제
# 실제 데이터 삭제가 아님. 
c.drop(["무력"], axis=1)

   이름  지력  정치   매력   자  무력+10
0  조조  91  94   96  맹덕     82
1  자룡  76  65  110  자룡    107
2  주유  96  87   93  공근     81

In [30]:
# 실제 데이터의 삭제는 아님 
c

   이름   무력  지력  정치   매력   자  무력+10
0  조조   82  91  94   96  맹덕     82
1  자룡  107  76  65  110  자룡    107
2  주유   81  96  87   93  공근     81

In [31]:
# 0번 인덱스 값을 삭제 
c.drop(0, axis=0)

   이름   무력  지력  정치   매력   자  무력+10
1  자룡  107  76  65  110  자룡    107
2  주유   81  96  87   93  공근     81

In [32]:
# 실제 데이터의 삭제는 아님 
c

   이름   무력  지력  정치   매력   자  무력+10
0  조조   82  91  94   96  맹덕     82
1  자룡  107  76  65  110  자룡    107
2  주유   81  96  87   93  공근     81

In [33]:
# 무력을 실제 데이터로 삭제. inplace 옵션을 이용하면 데이터에 바로 반영 됨 
c.drop(["무력"], axis=1, inplace=True)
c

   이름  지력  정치   매력   자  무력+10
0  조조  91  94   96  맹덕     82
1  자룡  76  65  110  자룡    107
2  주유  96  87   93  공근     81

# 속성
데이터프레임의 주요 속성을 알아보겠습니다. 

속성|설명
-|-
index|인덱스
columns|칼럼
values|값
shape|인덱스, 칼럼 사이즈
size|값의 길이
T|칼럼, 인덱스를 전환

In [34]:
# 인덱스 정보 
c.index

RangeIndex(start=0, stop=3, step=1)

In [35]:
# 칼럼 정보 
c.columns

Index(['이름', '지력', '정치', '매력', '자', '무력+10'], dtype='object')

In [36]:
# 값 
c.values

array([['조조', 91, 94, 96, '맹덕', 82],
       ['자룡', 76, 65, 110, '자룡', 107],
       ['주유', 96, 87, 93, '공근', 81]], dtype=object)

In [37]:
# 인덱스 길이, 칼럼 길이
c.shape

(3, 6)

In [38]:
# 값의 길이 
c.size

18

In [39]:
# 칼럼. 인덱스를 전환 
c.T

        0    1   2
이름     조조   자룡  주유
지력     91   76  96
정치     94   65  87
매력     96  110  93
자      맹덕   자룡  공근
무력+10  82  107  81